export const normativeSecurity = [
    {
        title: 'ДСТУ 4708:2006',
        value: 'Інформаційні технології. З`єднувачі інтерфейсу зв`язку, використовувані в локальних обчислювальних мережах (ISO/IEC TR 9578:1990, NEQ).'
    },
    {
        title: 'ISO/IEC TR 9578:1990',
        value: 'Information Technology — Communication interface connectors used in local area networks (Інформаційні технології. З’єднувачі інтерфейсу зв’язку, використовувані в локальних обчислювальних мережах).'
    },
    {
        title: 'ISO/IEC TR 16166:2010',
        value: 'Information technology — Telecommunications and information exchange between systems — Next Generation Corporate Networks (NGCN) — Security of session-based communications.'
    },
    {
        title: '- ДСТУ IEC TR 61850-90-12:2018 (IEC TR 61850-90-12:2015, IDT)',
        value: 'Комунікаційні мережі та системи для автоматизації електроенергетичних підприємств. Частина 90-12. Настанови щодо розроблення глобальної мережі (WAN).'
    },
    {
        title: 'ISO/IEC/IEEE DIS 8802-1CS',
        value: 'Telecommunications and exchange between information technology systems — Requirements for local and metropolitan area networks.'
    },
    {
        title: 'ISO/IEC/IEEE 8802-1AC:2018',
        value: 'Information technology — Telecommunications and information exchange between systems — Local and metropolitan area networks'
    }
]


export const globalNetwork = {
    object: [
        '- Підприємство, що спеціалізується на сільськогосподарській діяльності.',
        '- Підприємство, що спеціалізується на видобувній вугільній діяльності.',
        '- Підприємство із страховим видом діяльності.',
    ],
    networkCharacteristic: {
        environmentOfShare: [
            '- Оптоволокно',
            '- Коаксіальний кабель',
            '- Вита пара',
            '- Радіоканал',
            '- Інфрачервоний канал'],
        dataPlacement: ['З розділеним банком даних.']
    },

    attacks: [
        {
            title: 'Сканування портів.', value: ['- Використання систем виявлення вторгнень (IDS)',
                '- Відключення ехо ICMP та ехо-відповіді на периферійних маршрутизаторах',
                '- Щорічна профілактична перевірка на проникнення спеціалістами із захисту інформації.',]
        },
        {
            title: 'IP-спуфінг.', value: ['- Використання криптографічної аутентифікації.',
                '- Контроль доступу.',
                '- Двофакторна або трифакторна аутентифікація.',]
        },
        {
            title: 'Міжсайтовий скриптинг або XSS-атака.',
            value: ['- Заборона завантаження довільних файлів на сервер, щоб уникнути завантаження шкідливих скриптів.',
                '- Збереження завантажених файлів у базі даних.',
                '- Двофакторна або трифакторна аутентифікація',
                '- Щорічна профілактична перевірка на проникнення спеціалістами із захисту інформації.',]
        },
        {
            title: 'Атаки відмови в обслуговуванні',
            value: ['- Функції антиспуфінгу. Правильна конфігурація функцій антиспуфінгу на маршрутизаторах і міжмережевих екранах допоможе знизити ризик DoS. Ці функції повинні включати, як мінімум, фільтрацію RFC 2827.',
                '- Функції анти-DoS. Правильна конфігурація функцій анти-DoS на маршрутизаторах та міжмережевих екранах може обмежити ефективність атак.',
                '- Обмеження обсягу трафіку (traffic rate limiting). Організація може попросити провайдера обмежити обсяг трафіку.',]
        },
        {
            title: 'Phishing-атаки',
            value: ['- Використання лише перевірених ресурсів та шляхи доступу до них.',
                '- Використання антивірусних засобів та регулярно оновлювати їх сигнатури.',
                '- Проходження працівниками курсів та вебінарів по захисту інформації та протидії соціальній інженерії',]
        },
        {
            title: 'Віруси та мережні хробаки',
            value: ['- Використання антивірусних програм',
                '- Використання фаєрволу або брандмауеру. Це міжмережевий екран, який здійснює контроль і фільтрацію мережевих пакетів.',
                '- Протоколювання і аудит',
                '- Використання засобів архівації даних.',
                '- Перевірка вкладених файлів електронної пошти. ',]
        }
    ],


    threads: [
        {
            title: 'Витік інформації технічними каналами.',
            value: [
                '- Пасивні (ослаблення побічних електромагнітних випромінювань) та активні (створенн просторових маскувальних електромагнітних перешкод з метою зменшенння відносини сигнао\\шум до допустимого рівня) методи захисту.)',
                '- Екранування технічних засобів.'
            ]
        },
        {
            title: 'Несанкціонований доступ до мережі.',
            value: ['    - Залучення спеціалістів із захисту інформації для перевірки на стійкість до несанкціонованого доступу.',
                '- Проведення профілактичних розмов та вебінарів із працівниками для підвищення розуміння захисту інформації (протидія соціальній інженерії).',]
        },
        {
            title: 'Порушення цілісності (модифікація, видалення, підміна).',
            value: ['- Використання двофакторної або трифакторної аутентифікації.',
                '- Використання резервних копій важливих даних.',
                '- Оновлення операційної системи. Критичні оновлення безпеки Windows закривають дірки в операційній системі, які використовуються для проникнення вірусів і шкідливих програм.',
                '- Використання фаєрволу або брандмауеру. Це міжмережевий екран, який здійснює контроль і фільтрацію мережевих пакетів.',
                '- Протоколювання і аудит',]
        },
        {
            title: 'Порушення доступності (Відмова в обслуговуванні: блокування систем ідентифікації та/або блокування ресурсів).',
            value: ['- Використання систем відновлення роботи серверів.',
                '- Використання програмних засобів для розподілення нагрузки між серверами або використання систем, що у випадку збільшенн нагрузки автоматично запускають додаткові сервери.',]
        },
    ],

    normativeSecurity: normativeSecurity

}


export const localNetwork = {
    object: [
        '- Підприємство із фінансовим видом діяльності.',
        '- Підприємство, що спеціалізується на сільськогосподарській діяльності.',
    ],
    networkCharacteristic: {
        environmentOfShare: [
            '- Коаксіальний кабель',
            '- Вита пара',
            '- Радіоканал',
            '- Інфрачервоний канал'],
        dataPlacement: ['З централізованим банком даних.']
    },

    attacks: [
        {
            title: 'ARP Атаки.', value: [
                '- Організація VLAN',
                '- Використання шифрування',
                '- Використання статичного ARP (налаштування ARP-таблиці самостійно)',
            ]
        },
        {
            title: 'Шпигунські програми.', value: [
                '- Оновлення операційної системи. Критичні оновлення безпеки Windows закривають дірки в операційній системі, які використовуються для проникнення вірусів і шкідливих програм',
                '- Використання антивірусних програм.',
                '- міжмережевий екран, який здійснює контроль і фільтрацію мережевих пакетів.',
                '- Використання засобів архівації даних.',
                '- Перевірка вкладених файлів електронної пошти.',

            ]
        },
        {
            title: ' Ін\'єкція XPath.',
            value: [
                '- Перевірка коректності. (Перевірка не тільки типу даних, що вводяться, але також їх формат, довжину, діапазон і вміст має знаходити більшість підозрілих спеціальних символів).',

                '- Перевірка даних на веб-сервері. Для захисту проти XPath-впровадження та інших форм впровадження коду необхідно перевіряти всі дані, що передаються від Web-сервера до служб системи зберігання даних.',

            ]
        },
        {
            title: 'Rootkit',
            value: [
                '- Використання антивірусних засобів та регулярне оновлення їх сигнатур.',
                '- Використання антисніферів (Наприклад, AntiSniff або PromiScan).',
                '- Використання міжмережевих екранів. -Використання антируткітів.'
            ]
        },

    ],


    threads: [
        {
            title: 'За природою виявлення (природні та штучні).',
            value: [
                `Природні:
                - Система пожаротушіння.
                - Встановлення серверів вище рівня можливого наводнення.
                - Укріплення конструкцій приміщення для унеможливлення пошкодження технічних засобів у випадку сильних вітрів та ураганів.`,

                `Штучні:
                - Заборона на встановлення програм, що не входять до списку необхідних для роботи і надалі порушують роботу системи, що і призводить до втрати інформації.
                - Перевірка працівників та їх комп’ютерів для виявлення потенційних спроб зміни конфіденційної інформації або ж її поширення.`

            ]
        },
        {
            title: 'Вандалізм.',
            value: [
                '- Для захисту проти впровадження шкідливих даних та інших форм впровадження коду необхідно перевіряти всі дані, що передаються від Web-сервера до служб системи зберігання даних.'
            ]
        },
        {
            title: 'Пропаганда та інформаційна війна.',
            value: [
                '- Надання адреси електронної пошти лише перевіреним джерелам.',
                '- Протидія зі сторони провайдера, який іноді настроюється таким чином, щоб він автоматично визначав поштові атаки. У більшості випадків вони розпізнаються сервером за допомогою порівняння вихідних IP-адрес вхідних повідомлень.'

            ]
        },

    ],

    normativeSecurity: normativeSecurity

}

export const corporateNetwork = {
    object: [
        '- Підприємство, що спеціалізується на виробництві ракетно-космічної техніки та технологій оборонного, наукового та народногосподарського призначення'
    ],
    networkCharacteristic: {
        environmentOfShare: [
            '- Коаксіальний кабель',
            '- Вита пара',
            '- Радіоканал',
            '- Інфрачервоний канал'],
        dataPlacement: ['З розділеним банком даних.']
    },

    attacks: [
        {
            title: 'Mailbombing.', value: [
                '- Надання адреси електронної пошти лише перевіреним джерелам..',
                '- Як перешкода для mailbombing-а може виступати і Web-сайт провайдера, який іноді настроюється таким чином, щоб він автоматично визначав поштові атаки. У більшості випадків вони розпізнаються сервером за допомогою порівняння вихідних IP-адрес вхідних повідомлень. .',
            ]
        },
        {
            title: 'Сканування портів.', value: [
                '- Використання систем виявлення вторгнень (IDS).',
                '- Відключення ехо ICMP та ехо-відповіді на периферійних маршрутизаторах.',
                '- Щорічна профілактична перевірка на проникнення спеціалістами із захисту інформації.',

            ]
        },
        {
            title: 'man-in-the-middle.',
            value: [
                'Використання шифрування даних.',


            ]
        },
        {
            title: 'SQL-ін`єкция',
            value: [
                '- Для цілих і дробових величин перед їх використанням у запиті достатньо привести величину до потрібного типу.',
                '- У рядках, які передбачається використовувати всередині like, regexp і тд, необхідно також заекранувати спеціальні символи, що застосовуються в цих операторах, якщо це необхідно. Інакше можна задокументувати використання цих символів.',

            ]
        },

    ],


    threads: [
        {
            title: 'Небажаний контент.',
            value: [
                '- Заборона на переадресацію на сайти із поганою репутацією.',
                '- Використання антивірусних програм',
                '- Оновлення операційної системи.',
                '- Використання фаєрволу або брандмауеру.',
                '- Перевірка вкладених файлів електронної пошти.',
                '- Використання у деяких продуктах для особистої та корпоративної безпеки «пісочниці» - засіб запуску додатків в ізольованому середовищі, звідки неможливо завдати шкоди операційній системі та даним.',
                '- Використання анти-спам фільтрації і чорні списки.',


            ]
        },
        {
            title: 'Втрата даних.',
            value: [
                '- Незалежно від джерела загрози, основним захистом є резервне копіювання файлів. Інформацію можна зберігати на зовнішніх жорстких дисках, хмарних сховищах. Важливо регулярно робити резервне копіювання та переконуватись, що копія повністю відповідає оригіналу.',
                '- Для захисту від випадкових втрат, що відбуваються з вини користувачів, необхідно подбати про підвищення комп`ютерної грамотності персоналу.',
                ' - Враховуючи ймовірність саботажу та деструктивних дій зловмисників, слід подбати про фізичну безпеку комп`ютерної техніки, відеоспостереження, хороші замки на серверних шафах. На комп`ютери персоналу можна встановити засоби спостереження за діяльністю працівників, що допоможе виявити співробітників, які завдають умисної шкоди файлам із важливою інформацією.',
                '- Комп`ютерне обладнання повинно бути у відповідних умовах: чистота, стабільна температура повітря, допустимий рівень вологості, захист від падінь та стрибків напруги. ',

            ]
        },
    ],

    normativeSecurity: normativeSecurity

}

export const privateNetwork = {
    object: [
        '- Персональний комп`ютер',
        '- Смартфон',
        '- Планшет',
        '- Розумні пристрої ІоТ',
    ],
    networkCharacteristic: {
        environmentOfShare: [
            '- Вита пара',
            '- Радіоканал',
            '- Інфрачервоний канал',

        ],
        dataPlacement: ['Локальнe']
    },

    attacks: [
        {
            title: 'Атака на переповнення буфера.',
            value: [
                '- Коригування вихідних кодів програми для усунення вразливостей.',
                '- Використання нездійсненних буферів. Суть методу полягає у забороні виконання коду в сегментах даних та стеку.',
                '- Застосування перевірок виходу за межі. В основі цього методу лежить виконання перевірок виходу за межі змінної при кожному зверненні до неї.',
                '- Застосування перевірок цілісності. Рішення, що ґрунтується на даному методі, отримано завдяки проекту Synthetix.',

            ]
        },
        {
            title: 'Витік інформації технічними каналами.',
            value: [
                '- Контроль і обмеження доступу на об’єкти та у виділені приміщення.',
                '- фільтрація інформаційних сигналів.',


            ]
        },
        {
            title: '- Троянські програми\n' +
                '- Мережні хробаки\n' +
                '- Віруси\n' +
                '- Шпигунські програми\n' +
                '- Спам\n.',
            value: [
                '- Оновлення операційної системи. Критичні оновлення безпеки Windows закривають дірки в операційній системі, які використовуються для проникнення вірусів і шкідливих програм.',
                '- Використання фаєрволу або брандмауеру. Це міжмережевий екран, який здійснює контроль і фільтрацію мережевих пакетів.',
                '- Протоколювання і аудит',
                '- Використання засобів архівації даних.',
                '- Перевірка вкладених файлів електронної пошти.',


            ]
        },
    ],


    threads: [
        {
            title: 'Витік інформації технічними каналами.',
            value: [
                '- Пасивні (ослаблення побічних електромагнітних випромінювань) та активні (створенн просторових маскувальних електромагнітних перешкод з метою зменшенння відносини сигнао\\шум до допустимого рівня) методи захисту.',
                '- Екранування технічних засобів.'
            ]
        },
        {
            title: 'Шахрайство.',
            value: [
                'Одним із видів боротьби з шахрайством є перевірки вручну — у цьому випадку трудовитрати становитимуть не менше 80% загального обсягу робіт. Ще один вид — ІТ-залежні методи, коли боротьба з шахрайством ґрунтується на спеціальних вибірках, що надаються ІТ-підрозділами компанії, завдяки чому значно скорочуються трудовитрати та зростає кількість контрольованих потоків даних. Третій вид протидії фроду - автоматизовані методи використання програмно-апаратних засобів.'
            ]
        },
        {
            title: 'За місцем розташування інформації.',
            value: [
                `На зовнішньому запам’ятовуючому пристрої:
    -контроль і обмеження  доступу
В оперативній пам’яті:
    - Використання антивірусних програм
- Використання браундмауера.`,
                `    У лініях зв’язку:
    -фільтрація сигналів та локалізація випромінювання
На терміналі або принтері:
    -контроль і обмеження  доступу.`

            ]
        },
    ],

    normativeSecurity: normativeSecurity

}